[
    {
        "source": "CNN",
        "title": "Boston Celtics end Cleveland Cavaliers’ unbeaten start to the season, Lakers rookie makes history and more from the NBA - CNN"
    },
    {
        "source": "Politico",
        "title": "House Republicans are playing the Trump card in committee chair races - POLITICO"
    },
    {
        "source": "9to5google.com",
        "title": "Android 16 DP1: Wi-Fi QR code sharing gets a cute Material You makeover - 9to5Google"
    },
    {
        "source": "CNN",
        "title": "Hong Kong hears from jailed media tycoon Jimmy Lai for the first time in four years at his trial - CNN"
    },
    {
        "source": "CNBC",
        "title": "U.S. closes embassy in Kyiv over potential 'significant' air attack as tensions with Russia soar - CNBC"
    },
    {
        "source": "Cageside Seats",
        "title": "NXT recap & reactions: School’s out forever - Cageside Seats"
    },
    {
        "source": "CNN",
        "title": "Bacteria and mold found during inspection of Tom’s of Maine facility, FDA says - CNN"
    },
    {
        "source": "CBS Sports",
        "title": "Nuggets' Russell Westbrook becomes first player in NBA history to reach 200 triple-doubles - CBS Sports"
    },
    {
        "source": "Politico",
        "title": "US envoy says Israel-Hezbollah truce is ‘within our grasp’ - POLITICO"
    },
    {
        "source": "CNBC",
        "title": "Target will report earnings before the bell. Here's what to expect - CNBC"
    },
    {
        "source": "BBC News",
        "title": "Biden agrees to give Ukraine anti-personnel mines - BBC.com"
    },
    {
        "source": "Internet",
        "title": "Apple Releases Urgent Updates to Patch Actively Exploited Zero-Day Vulnerabilities - The Hacker News"
    },
    {
        "source": "Financial Times",
        "title": "Chinese vessel spotted where Baltic Sea cables were severed - Financial Times"
    },
    {
        "source": "CNN",
        "title": "A mother’s agony: What Allyson Phillips has endured during the trial of the man accused of killing her daughter, Laken Riley - Yahoo! Voices"
    },
    {
        "source": "Financial Times",
        "title": "Marc Rowan emerges as a top contender to be Donald Trump’s Treasury secretary - Financial Times"
    }
]